Examinator/src/InformationRegisters/ПреподавателиОбученияСУО/ПреподавателиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПреподавателиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/УчастникиОбученияСУО/УчастникиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтсчетаПродолжительности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПродолжительности</name>
    <type>
      <types>EnumRef.ПродолжительностьОбученияСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/ПреподавателиОбученияСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбновитьДанныеВебКабинета(Пользователь, ДополнительныеДанные=Неопределено) Экспорт
	
	// Данная процедура вызывается из других объектов (не самостоятельно),
	// И не относится к конкретному объекту данных.
	
	УстановитьПривилегированныйРежим(Истина);
		
	ТаблицаПреподавателей = ВсеПреподавателиПользователя(Пользователь);
	ПреподавателиПользователя = Новый Массив;
	Для каждого СтрокаТП Из ТаблицаПреподавателей Цикл
		ПреподавателиПользователя.Добавить(ВебКабинетСУО.ПользовательСтруктура(СтрокаТП.Преподаватель, СтрокаТП.Наименование));
	КонецЦикла;
	
	// Записываем данные
	//
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(
		Пользователь,
		Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавателиПользователя,
		Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавателиПользователя,
		ОбщегоНазначенияСУ.ДанныеВJSON(ПреподавателиПользователя),
		Перечисления.ФорматыВебДанныхСУ.json);		
		
	
КонецПроцедуры

Функция ВсеПреподавателиПользователя(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПреподавателиОбученияСУО.Преподаватель КАК Преподаватель,
		|	ПреподавателиОбученияСУО.Преподаватель.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПреподавателиОбученияСУО КАК ПреподавателиОбученияСУО
		|		ПО УчастникиОбученияСУО.ПроведениеОбучения = ПреподавателиОбученияСУО.ПроведениеОбучения
		|			И УчастникиОбученияСУО.Сценарий = ПреподавателиОбученияСУО.Сценарий
		|ГДЕ
		|	УчастникиОбученияСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

#КонецЕсли
